// Написать программу,которая из имеющегося массива строк формирует массив из строк,длинна которых
// меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры,либо задать на старте
// выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями,лучше обойтись 
// исключительно массивами.

// массивами.

// ["hello", "2", "world", ":)"] => ["2", ":)"]

// ["1234", "1567", "-2", "computer science"] => ["-2"]

// ["Russia", "Denmark", "Kazan"] => []


string[] array1 = new string[5] {"123", "23", "hello", "world", "res"};
string[] array2 = new string[array1.Length];
void SecondArrayWithIF(string[] array1, string[] array2)
{
    
}